package mysteryLab;

abstract public class Game {

   protected String[][] questions = new questions[4][18];
   protected String[][] answers = new answers[4][9];
  
   questions[0][0] = "Πλάσμα που χαρακτηρίζεται από θεϊκή ομορφιά και υπέροχη φωνή";
   questions[0][1] = "Είναι τα αποτελέσματα  από την χρήση μαγικών βοτάνων που προκαλούν την απώλεια της αίσθησης του χωροχρόνου"; 
   questions[0][2] = "Η ιδιότητα της Κίρκης που της επιτρέπει να επικαλεί υπερφυσικές δυνάμεις ";
   questions[0][3] = "Μητέρα της Κίρκης, το όνομα της προέρχεται από μία χώρα της Ανατολής";
   questions[0][4] = "Ζούσε σε νησί";
   questions[0][5] = "Ήταν προστάτης της μητέρας του";
   questions[0][6] = "Με την βοήθεια μιας θεάς μεταμφιέστηκε προκειμένου να ανακαλύψει την αλήθεια για τον πατέρα του ";
   questions[0][7] = "Είχε έναν ετεροθαλή αδερφό με παρεμφερές όνομα";
   questions[0][8] = "Ήταν πρίγκιπας του νησιού στο οποίο κατοικούσε";
   questions[0][9] = "Το όνομα του προέρχεται από την ένωση 2 συνθετικών";
   questions[0][10] = "Δεν ήθελε να πιστέψει τον χρησμό για τον θάνατο του πατέρα του";
   questions[0][11] = "Παντρεύτηκε την ερωμένη του πατέρα του";
   questions[0][12] = "Σε γνωστό έργο του Ομήρου  έχουν αφιερωθεί 4 ραψωδίες στο όνομα του";
   questions[0][13] = "Προκειμένου να προστατέψει την τιμή της μητέρας του, αναγκάστηκε να δολοφονήσει 10 ανθρώπους";
   questions[0][14] = null
   questions[0][15] = "Προστάτης της τρανός, όλου του κόσμου φανερός, αλλά μην του πειράξεις τα ιερά, η ζωή τελειώνει μονομιάς. Ποιός είναι;";
   questions[0][16] = "Αρνήθηκε επισκέπτες δίχως σεβασμό κι αμέσως τους οδήγησε στο αιώνιο κακό. Ποιο ήταν;";
   questions[0][17] = "Μοιραία συναντήθηκαν στην ίδια ιστορία, ταυτόσημες οντότητες, συνεργοί στην αμαρτία. Κι ενώ αυτή την έκανε αιώνια εχθρό της, η μοίρα της τη γέλασε και αγάπησε τον γιο της. Ποια είναι;";

   answers[0][0] = "ΝΥΜΦΗ";
   answers[0][1] = "ΠΑΡΑΙΣΘΗΣΕΙΣ";
   answers[0][2] = "ΜΑΓΙΣΣΑ";
   answers[0][3] = "ΠΕΡΣΗ";
   answers[0][4] = "ΤΗΛΕΜΑΧΟΣ";
   answers[0][5] = "ΓΑΛΑΝΘΟΣ";
   answers[0][6] = "ΗΛΙΟΣ";
   answers[0][7] = "ΧΟΙΡΟΣ";
   answers[0][8] = "ΠΗΝΕΛΟΠΗ";
   
  // ΕΡΩΤΗΣΕΙΣ-ΑΠΑΝΤΗΣΕΙΣ ΘΗΣΕΑ
   questions[1][0] = "Μικρό , βραδυκίνητο ,φυτοφάγο ζώο";
   questions[1][1] = "Νησί στο οποίο πέθανε ο Θησέας"; 
   questions[1][2] = "Έπιπλο στο οποίο κοιμόμαστε ";
   questions[1][3] = "Εγκληματίες που σκότωσε ο Θησέας";
   questions[1][4] = "Είχε σώμα ανθρώπου και κεφάλι ταύρου";
   questions[1][5] = "Ο μύθος του συνδέεται με τοπικά έθιμα της εποχής";
   questions[1][6] = "Νικήθηκε από το Θησέα";
   questions[1][7] = "Γεννήθηκε από ένα ταύρο και μία θνητή γυναίκα";
   questions[1][8] = "Κατοικούσε σε λαβύρινθο";
   questions[1][9] = "Ήταν η τιμωρία των Αθηναίων";
   questions[1][10] = "Απασχόλησε έργο του ιστορικού Πλούταρχου";
   questions[1][11] = "Συμβολίζει τη μία πλευρά του θεού Ήλιου";
   questions[1][12] = "Συνδεδεμένος με το έθιμο της ανθρωποκτονίας";
   questions[1][13] = "Τα κέρατά του αντιπροσωπεύουν το φεγγάρι";
   questions[1][14] = null
   questions[1][15] = "Με το που μπείς, θα χαθείς , δεν ξέρεις που να πάς , πίσω δε γυρνάς...";
   questions[1][16] = "Γύρω γύρω όλοι και στη μέση η αρχή ,το τέλος άμα πιάσεις θα ξεμπερδευτείς .";
   questions[1][17] = "Όστρια φύσαγε στον έρωτα μας , κλωστή που κόπηκε μεσοπέλαγα η καρδιά μας .";
   
   answers[1][0] = "ΧΕΛΩΝΑ";
   answers[1][1] = "ΣΚΥΡΟΣ";
   answers[1][2] = "ΚΡΕΒΑΤΙ";
   answers[1][3] = "ΛΗΣΤΕΣ";
   answers[1][4] = "ΜΙΝΩΤΑΥΡΟΣ";
   answers[1][5] = "ΡΟΠΑΛΟ";
   answers[1][6] = "ΛΑΒΥΡΙΝΘΟΣ";
   answers[1][7] = "ΚΟΥΒΑΡΙ";
   answers[1][8] = "ΑΡΙΑΔΝΗ";
  

 //ΕΡΩΤΗΣΕΙΣ ΑΠΑΝΤΗΣΕΙΣ ΠΕΡΣΕΦΟΝΗΣ
   questions[2][0] = "Η Γη ξαφνικά άνοιξε την ώρα που η νεαρή μάζευε λουλούδια παρέα με τις...";
   questions[2][1] = "Η Περσεφόνη απήχθη από τον θεό του Κάτω Κόσμου.";
   questions[2][2] = "Συναίσθημα που ένιωσε η θεά Δήμητρα όταν έχασε την κόρη της και πιθανώς ο Πλούτωνας με την υπόσχεσή του στον Δία.";
   questions[2][3] = "Γιορτή-Μυστήρια στα οποία λατρεύονταν μητέρα και κόρη.";
   questions[2][4] = "Θεά του Ολύμπου.";
   questions[2][5] = "Απόμακρη και ακατάδεκτη.";
   questions[2][6] = "Είχε θνητό εραστή.";
   questions[2][7] = "Το πένθος της την απομάκρυνε από τον Όλυμπο και την έφερε περιπλανώμενη στον κόσμο των θνητών.";
   questions[2][8] = "Πρώτοι διεκδικητές του έρωτά της ήταν τα αδέρφια της.";
   questions[2][9] = "Είχε επίσης το προσωνύμιο Ερινύα μετά τον βιασμό της από τον Ποσειδώνα.";
   questions[2][10] = "Κεντρικός χαρακτήρας στα Ελευσίνια Μυστήρια και πιθανότατα λατρευόταν και πριν από το Δωδεκάθεο.";
   questions[2][11] = "Την εποχή της σποράς πραγματοποιούνταν προς τιμήν της η γιορτή των Θεσμοφορίων.";
   questions[2][12] = "Σύμβολά της ήταν οι γερανοί, το στάχυ, ο νάρκισσος, η μυρτιά και ο κρόκος. Ιέρειές της ήταν οι μέλισσες.";
   questions[2][13] = "Ανθρωπόμορφη θεά της καλλιέργειας και της γονιμότητας.";
   questions[2][14] = null
   questions[2][15] = "Την πλάση όλη μάρανε με τη θλίψη της, τον χειμώνα επέφερε η αγωνία της, μια μητέρα χωρίς την κόρη της έσπειρε την δυστυχία της. Ποια είναι;";
   questions[2][16] = "Μαζί του την ήθελε και παράκοσε τη δικιά της επιθυμία. Σε έναν άλλον κόσμο την έφερε σπαρμένο με φόβο και αγωνία. Βασίλειο της έδωσε με απόλυτη ησυχία. Ποιος είναι;";
   questions[2][17] = "Τη στερούνταν με την απουσία μιας όμορφης θεάς, μα η ανάδυσή της έφερνε ευφορία και γονιμότητα στο έδαφος ξανά. Ποια είναι;";

   answers[2][0] = "ΩΚΕΑΝΙΔΕΣ";
   answers[2][1] = "ΠΛΟΥΤΩΝΑΣ";
   answers[2][2] = "ΘΥΜΟΣ";
   answers[2][3] = "ΕΛΕΥΣΙΝΙΑ";
   answers[2][4] = "ΔΗΜΗΤΡΑ";
   answers[2][5] = "ΑΝΑΓΕΝΝΗΣΗ";
   answers[2][6] = "ΔΗΜΗΤΡΑ";
   answers[2][7] = "ΠΛΟΥΤΩΝΑΣ";
   answers[2][8] = "ΑΝΟΙΞΗ";
   
   
  }
