package mysteryLab;

public class Game {

   String[][] questions = new questions[4][18];
   String[][] answers = new answers[4][9];
  
   questions[0][0] = "Πλάσμα που χαρακτηρίζεται από θεϊκή ομορφιά και υπέροχη φωνή";
   questions[0][1] = "Είναι τα αποτελέσματα  από την χρήση μαγικών βοτάνων που προκαλούν την απώλεια της αίσθησης του χωροχρόνου"; 
   questions[0][2] = "Η ιδιότητα της Κίρκης που της επιτρέπει να επικαλεί υπερφυσικές δυνάμεις ";
   questions[0][3] = "Μητέρα της Κίρκης, το όνομα της προέρχεται από μία χώρα της Ανατολής";
   questions[0][4] = "Ζούσε σε νησί";
   questions[0][5] = "Ήταν προστάτης της μητέρας του";
   questions[0][6] = "Με την βοήθεια μιας θεάς μεταμφιέστηκε προκειμένου να ανακαλύψει την αλήθεια για τον πατέρα του ";
   questions[0][7] = "Είχε έναν ετεροθαλή αδερφό με παρεμφερές όνομα";
   questions[0][8] = "Ήταν πρίγκιπας του νησιού στο οποίο κατοικούσε";
   questions[0][9] = "Το όνομα του προέρχεται από την ένωση 2 συνθετικών";
   questions[0][10] = "Δεν ήθελε να πιστέψει τον χρησμό για τον θάνατο του πατέρα του";
   questions[0][11] = "Παντρεύτηκε την ερωμένη του πατέρα του";
   questions[0][12] = "Σε γνωστό έργο του Ομήρου  έχουν αφιερωθεί 4 ραψωδίες στο όνομα του";
   questions[0][13] = "Προκειμένου να προστατέψει την τιμή της μητέρας του, αναγκάστηκε να δολοφονήσει 10 ανθρώπους";
   questions[0][14] = null
   questions[0][15] = "Προστάτης της τρανός, όλου του κόσμου φανερός, αλλά μην του πειράξεις τα ιερά, η ζωή τελειώνει μονομιάς. Ποιός είναι;";
   questions[0][16] = "Αρνήθηκε επισκέπτες δίχως σεβασμό κι αμέσως τους οδήγησε στο αιώνιο κακό. Ποιο ήταν;";
   questions[0][17] = "Μοιραία συναντήθηκαν στην ίδια ιστορία, ταυτόσημες οντότητες, συνεργοί στην αμαρτία. Κι ενώ αυτή την έκανε αιώνια εχθρό της, η μοίρα της τη γέλασε και αγάπησε τον γιο της. Ποια είναι;";

   answers[0][0] = "ΝΥΜΦΗ";
   answers[0][1] = "ΠΑΡΑΙΣΘΗΣΕΙΣ";
   answers[0][2] = "ΜΑΓΙΣΣΑ";
   answers[0][3] = "ΠΕΡΣΗ";
   answers[0][4] = "ΤΗΛΕΜΑΧΟΣ";
   answers[0][5] = "ΓΑΛΑΝΘΟΣ";
   answers[0][6] = "ΗΛΙΟΣ";
   answers[0][7] = "ΧΟΙΡΟΣ";
   answers[0][8] = "ΠΗΝΕΛΟΠΗ";
  
  
}
